import random
def get_intro_text():
    return (
        "Вітаю у грі Підземелля та Дракони! Натисніть кнопку нижче, щоб створити героя."
    )

def story_text():
    return (
        "Ви ввійшли у підземелля. Темрява охоплює все навколо, "
        "ледь пробиваючись крізь світло вашого факела. Ви стоїте на роздоріжжі:\n\n"
        "Ліворуч ви чуєте дивне завивання вітру з темного тунелю.\n"
        "Праворуч ледь видно слабке мерехтіння світла, ніби там щось чекає на вас."
    )

def nothing_encountered_text():
    return "Ви не зустріли нікого. Темрява навколо і тиша вас супроводжує..."

def get_encounter_monster_text(monster):
    return f"Ви зустріли {monster.name} з {monster.hp} HP та атакою {monster.attack}!"

# У файлі game_story.py
def get_encounter_chest_text(item):
    """Генерує текст для зустрічі зі скринею."""
    if item:
        return f"Ви знайшли скриню і в ній лежить: {item}!"
    else:
        return "Ви відкрили порожню скриню."


def get_random_story():
    stories = [
        "Ви натрапили на старий покинутий храм, де чутно таємничі голоси.",
        "Раптом вас оточили пірати, які вимагають від вас золоті монети.",
        "Ви виявили таємний прохід, що веде до похмурої печери з незнайомими звуками.",
        "На вас чекає старий мудрець, який пропонує вам незвичайні завдання.",
        "Раптом перед вами з'являється магічний портал, що світиться яскравими кольорами."
    ]
    return random.choice(stories)
